app/controllers/matches_controller.rb

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 3)